app/controllers/users_controller.rb

  def index
    @users = User.all.paginate(:page =>params[:page], :per_page => 2)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])
    if verify_recaptcha :private_key => '6LdMmsYSAAAAAHzIWZ3s5vk5pCoIMarn3v2uAIEQ'
      if @user.save
---
INSERT INTO "users" ("name", "mail", "created_at", "updated_at", "address") VALUES ('sriram', 'sriram.in22@gmail.com', '2011-07-27 03:00:21.933457', '2011-07-27 03:00:21.933457', 'jnv')